Revit 2027 API
Path3DDistributionRebarHandles Enumeration
 This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form 3D Path Distribution have. The tag of a [!:Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle] RebarConstrainedHandle can be obtained by calling the [!:Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()]
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum Path3DDistributionRebarHandles
Public Enumeration Path3DDistributionRebarHandles
public enum class Path3DDistributionRebarHandles
type Path3DDistributionRebarHandles
Members
Member name | Value | Description
DistributionPath | 2 |  Tag for handle representing the Distribution Path. This handle accepts constraints only to host edges. The constraint can't have distance to the host edges.
EndOfDistributionPath | 4 |  Tag for handle representing the End Distribution Path. This handle accepts constraints only to host faces or to covers.
FirstSegment | 6 |  Tag for handle representing the first segment in a bar in set. The segment N will have the tag Path3DDistributionRebarHandles.FirstSegment + N - 1. All segment handles accept constraints only to host edges or to the cover of the host edges. These constraints can have distance to their targets.
SetOrientation | 5 |  Tag for handle representing the Set Orientation. This handle accepts constraints only to host faces or to covers.
StartOfDistributionPath | 3 |  Tag for handle representing the Start Distribution Path. This handle accepts constraints only to host faces or to covers.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace